app/controllers/pokemon_controller.rb

	def create
		@pokemon = Pokemon.new(pokemon_params)

		if @pokemon.save
---
INSERT INTO "pokemons" ("attack", "created_at", "defense", "image_url", "moves", "name", "poke_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @pokemon = Pokemon.find(params[:id])
    if @pokemon.update_attributes(pokemon_params)
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "pokemons" SET "attack" = $1, "defense" = $2, "moves" = $3, "name" = $4, "poke_type" = $5, "updated_at" = $6 WHERE "pokemons"."id" = 1  [["attack", 100], ["defense", 100], ["moves", "---\n- bubble\n- water gun\n- twister\n- hydro pump\n"], ["name", "Seadra "], ["poke_type", "fighting"], ["updated_at", "2014-11-19 00:12:15.666501"]]